In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'A' : ['verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso'],
                   'B' : ['um', 'um', 'dois', 'tres', 'dois', 'dois', 'um', 'tres'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)
})

In [3]:
df

            A     B         C         D
0  verdadeiro    um -1.964410  0.438784
1       falso    um  0.515529  0.540152
2  verdadeiro  dois  0.930019 -0.497680
3       falso  tres  0.132820 -1.238741
4  verdadeiro  dois -1.104012 -2.272599
5       falso  dois  1.739117 -0.420452
6  verdadeiro    um -0.421288 -0.354163
7       falso  tres -0.513736 -0.732464

In [5]:
df.groupby(['A']).sum(['C', 'D'])

                   C         D
A
falso       1.873731 -1.851505
verdadeiro -2.559692 -2.685657

In [8]:
df.groupby(['A']).mean(['C', 'D'])

                   C         D
A
falso       0.468433 -0.462876
verdadeiro -0.639923 -0.671414

In [ ]:
df.groupby(['B']).sum(['C', 'D'])